//#include<stdio.h>
//int main()
//{
//	int cs = 2;
//	switch (cs)
// /////////case后面的值若与switch语句括号里面的值相同，则执行case后面的语句
//      注意；特别注意：switch语句后括号里的值可以是常量、变量或者表达式，但一定要是整形或者字符型。
//		//整型变量或整型变量表达式
//		//在C语言中，整型表达式的形式可以是以下几种：
//		///*1. 简单的整型变量，比如 x 或 y。
//		//2. 整型常量，比如 5 或 - 10。
//		//3. 由整型变量和常量以及整型运算符（ + 、 - 、 * 、 / 等）组成的表达式，比如 x + 3 或 y * 2。
//		//总的来说，整型表达式由整型变量、整型常量和整型运算符组成
//		//*/
//	{
//		//  case当中 顺序 数量都不限制
//		// case语句 只有在cs进去的时候起作用
//	case 1:
//		printf("剪刀");
//		break;
//	case 2:
//		printf("石头");
//		break;
//	case 3:
//		printf("布");
//		break;
//	default:
//		printf("错误");
//		break;
//	}
//	return 0;
//}