//#include<stdio.h>
// 
// []的作用就是  ： 偏移+解引用
//int main()
//{
//	int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//	int arr1[3][4] = { { 1,2,3,4},{5,6,7,8},{9,10,11,12} };
//	int arr2[3][4] = { 1,2,3 };
//	int arr3[3][4] = { {1},{2},{3} };
//	int arr4[][2] = { 1,2,3 };// 特别注意 列不能省略
//	//int arr4[2][] = { 1,2,3，4 };// 错误写法
//
//
//	int(*p1)[3][4] = &arr;
//	int(*p2)[4] = arr;
//	int*p3= *arr;//是arr[3][4]中[4]数组中的第一个元素
//
//
//
//
//	// 二维数组的遍历
//	for (int i = 0; i < 3; i++)
//	{
//		for (int j = 0; j < 4; j++)
//		{
//			printf("%d\t", arr[i][j]);
//			// \t的作用就相当于tab按键
//		}
//		printf("\n");
//	}
//	return 0;
//}