#include<stdio.h>
int main()
{
	// 指针的本质 存地址的变量
 	  // 如何定义一个指针   要指向的类型+ * + 变量名
	// 如何判断一个变量的类型 去掉变量名 剩下的就是类型
	// 如何判断指针指向的类型  去掉变量名  再去掉一个*  剩下的就是指向的类型
	//指针的偏移取决于指针指向的类型
	int a = 100;
	int* p = &a;
	*p = 20;
 	printf("%p\n", &a);
	printf("%p\n", p);
	printf("%p\n", p + 1);
	printf("%d\n", a);
	char b = 'a';
	char* pp = &b;
	printf("%p\n", pp);
	printf("%p\n", pp + 1);
	printf("%d\n", (int)sizeof(p));;
	printf("%d\n", (int)sizeof(pp));
	//64位程序 指针大小 8字节
	//32位程序 指针大小 4字节
	//  32位程序 4个字节 8个十六位进制数  64位程序 8个字节 16个十六进制数
	


// 指针的运算 1：比较大小 2：+或者-实质就是指针的偏移 

//int a = 0;
//char* p = &a;
////999999二进制表示为 0000 0000 0000 1111 0100 0010 0011 1111  高位->低位   
//// 大端存储
//*p = 0b00000000;
//*(p + 1) = 0b00001111;
//*(p + 2) = 0b01000010;
//*(p + 3) = 0b00111111;
//printf("%d\n", a);
//// 小端存储
//*p = 0b00111111;
//*(p + 1) = 0b01000010;
//*(p + 2) = 0b00001111;
//*(p + 3) = 0b00000000;
// 	 大端 小端 由主板的芯片决定
////大端存储 从高位存低端 低位存高端
////小端存储 刚好反过来 低位存地低端 高位存高端
//// 此电脑采用小端存储
//printf("%d\n", a);
//
//
//
//
//
//	//不要操作不属于本程序的内存
//	int a = 10;
//	int* p=&a;
// 	   printf("%d",*(p + 1))// 读取错误
//	*(p + 1) = 100;  // 错误示例  写入错误
//	// 定义指针时 名字要与*结合
//	 // 当一个指针不知道指向哪里时 就指向NULL
//	int* p = NULL;
//定义指针时 需要*与变量名先结合
//int* a,b;相当于int* a; int b;
//	二级指针
//	int a = 100;
//	int* p = &a;
//	int** pp = &p;
//	**pp = 200;
//	 pp==&p  *pp==*&p==p==&a  **pp==*p==*&a==a
//	printf("%d\n", a);
//	int b = 10;
//	*pp = &b;
//	printf("%d\n", *p);
	return 0;
}
