//#include<stdio.h>
//int main()
//{
//	//写代码将三个数从大到小输出
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int tmp = 0;
//	scanf("%d%d%d", &a, &b, &c);//%d之间空格不空格都可以 
//	// 注 如果%d之间加了其他东西例如（# ，），那我们输入的时候也必须严格按照格式加相应的符号
//
//	//算法实现
//	//a中放最大值 b次之 c中放最小
//
//	if (a < b)
//	{
//		//a = b; 这种做法是错误的 这样会导致a的值丢失
//		// 两个数之间交换值正确的做法是再引入一个变量
//		tmp = a;
//		a = b;
//		b = tmp;
//	}
//	if (a < c)
//	{
//		tmp = a;
//		a = c;
//		c = tmp;
//	}
//	if (b < c)
//	{
//		tmp = b;
//		b = c;
//		c = tmp;
//	}
//	printf("%d %d %d", a, b, c);
//	return 0;
//}