//#include<stdio.h>
//int main()
//{
//	int a[] = { 1,2,3,4,5,4,3,2,1 };
//	int sz = sizeof(a) / sizeof(a[0]);
//	int i = 0;
//	//                           算法一
//	//for (i = 0; i < sz; i++)//算法实现
//	//{
//	//	//统计a[i]在数组中出现了几次
//	//	int count = 0; //计数器
//	//	int j = 0;
//	//	for (j = 0; j < sz; j++)
//	//	{
//	//		if (a[i] == a[j])//让a[i]和数组中每个元素都比较
//	//		{
//	//			count++;
//	//		}
//	//	}
//	//	if (count == 1)
//	//	{
//	//		printf("单身狗：%d\n",a[i]);
//	//		break; //找到一个单身狗就不找了
//	//	}
//
//	//}
//	//                            算法二
//	// 利用异或运算^ 1^1^2^2^3^3^4^4^5=5
//	// 二进制位异或运算 位相同为0  不同为1
//	int ret = 0;
//	for (i = 0; i < sz; i++)
//	{
//		ret = ret ^ a[i];
//	}
//	printf("单身狗是：%d", ret);
//
//
//
//	return 0;
//}